<?php
// ! ПРИМІТКИ !
// * db_name генеруються автоматично при створенні класу Database тому немає потреби визначати це тут
// * якщо db_user не задати, то він генеруються автоматично - якщо дотримуватись правил з документації, то тут його краще не визначати
// * це дозволить не тримати дані для повного доступу до БД разом
return [
    'db_host' => 'localhost',
    // 'db_user' => 'user',
    'db_pass' => 'password',
    'db_prefix' => 'sf_',
    'charset' => 'utf8mb4',
    'options' => [
        {{PDO::ATTR_ERRMODE}} => {{PDO::ERRMODE_EXCEPTION}},// Установка режиму обробки помилок
        {{PDO::ATTR_PERSISTENT}} => true,// Встановлюємо постійне підключення з БД
        {{PDO::ATTR_EMULATE_PREPARES}} => false,// Вимкнення емуляції підготовлених запитів (тобто будуть використовуватися реальні підготовлені запити на рівні БД, що покращує безпеку)
        //PDO::FETCH_ASSOC,// Формат повернення
        //PDO::FETCH_NAMED,// Формат повернення
    ],
];