<?php
// --------------------
// Дані поточного сайту
// --------------------

/** Адреса сайту з незахищеним HTTP-доступом */
define('HTTP_SERVER', "http://{$_SERVER['HTTP_HOST']}/");

/** Адреса сайту з захищеним HTTPS-доступом */
define('HTTPS_SERVER', "https://{$_SERVER['HTTP_HOST']}/");

/** Домен сайту */
define('SITE_DOMAIN', $_SERVER['HTTP_HOST']);

// ----------------------------
// Налаштування поточного сайту
// ----------------------------

/** Тема сайту */
define('SITE_THEME', 'night');

/** Мова сайту за замовчуванням */
define('DEFAULT_LANGUAGE', 'uk');

/** Локаль сайту за замовчуванням */
define('DEFAULT_LOCALE', 'uk-UA');
// define('TEST_DEF', {{PDO::ATTR_ERRMODE}});

// -----------------------
// Налаштування фреймворку
// -----------------------

/** Автоматично перенаправляти на https з'єднання */
define('AUTO_REDIRECT_TO_HTTPS', false);

/**
 * Режим відображення опису помилки http-статусу
 * - 0 - Не показувати опис помилки
 * - 1/'universal' - Короткий універсальний опис без деталей
 * - 2/'maybe' - Опис може бути але не обов'язково
 * - 3/'full' - Обов'язковий повний опис помилки 
 */
define('DESCRIPTION_HTTP_STATUS', 2);

/**
 * Режим запуску додатка.
 *
 * Допустимі значення:
 * - 1/'Development' - В розробці
 * - 2/'Closed' - Закрито
 * - 3/'Alpha' - Альфа-тестування
 * - 4/'Beta' - Бета-тестування
 * - 5/'Production' - Активний
 * - 6/'Paused' - Призупинено для тех.обслуговування
 */
define('LAUNCH_MODE', 1);

/** Мова фреймворку за замовчуванням */
define('FRAMEWORK_DEFAULT_LANG', 'en');