<?php
// -----------------------
// Налаштування фреймворку
// -----------------------

/** Автоматично перенаправляти на https з'єднання */
define('AUTO_REDIRECT_TO_HTTPS', false);

/**
 * Режим відображення опису помилки http-статусу
 * - 0 - Не показувати опис помилки
 * - 1/'universal' - Короткий універсальний опис без деталей
 * - 2/'maybe' - Опис може бути але не обов'язково
 * - 3/'full' - Обов'язковий повний опис помилки 
 */
define('DESCRIPTION_HTTP_STATUS', 2);

/**
 * Режим запуску додатка.
 *
 * Допустимі значення:
 * - 1/'Development' - В розробці
 * - 2/'Closed' - Закрито
 * - 3/'Alpha' - Альфа-тестування
 * - 4/'Beta' - Бета-тестування
 * - 5/'Production' - Активний
 * - 6/'Paused' - Призупинено для тех.обслуговування
 */
define('LAUNCH_MODE', 2);

/** Мова фреймворку за замовчуванням */
define('FRAMEWORK_DEFAULT_LANG', 'uk');