<?php
// ------------------
// РЕСУРСНІ СУБДОМЕНИ
// ------------------

// ! ПРИМІТКИ !
// * Якщо ресурси та/або зображення зберігаються в межах цього ж сайту, то на місце потрібного субдомену, укажіть домен цього сайту 
// * Якщо ресурси та/або зображення зберігаються в межах цього ж сайту, то на місце потрібної директорії, укажіть директорію цього сайту

// ДОМЕНИ РЕСУРСНИХ САЙТІВ
/** Субдомен з ресурсами (скрипти, стилі та інші файли) */
define('SRC_SUB_DOMAIN', $_SERVER['HTTP_HOST']);

/** Субдомен із зображеннями (для зображень потрібних усім або декільком сайтам, а також для збереження користувацьких зображень) */
define('IMG_SUB_DOMAIN', $_SERVER['HTTP_HOST']);

// ДИРЕКТОРІЇ РЕСУРСНИХ САЙТІВ (мають бути на тому ж сервері, що й цей сайт або не використовуйте ці константи)
/** Директорія субдомену з ресурсами (скрипти, стилі та інші файли) */
define('DIR_SRC_SUB_DOMAIN', DIR_ROOT . SRC_SUB_DOMAIN . DS);

/** Директорія субдомену із зображеннями (для зображень потрібних усім або декільком сайтам, а також для збереження користувацьких зображень) */
define('DIR_IMG_SUB_DOMAIN', DIR_ROOT . IMG_SUB_DOMAIN . DS);