<?php

namespace RA7\Framework\system\config;

/**
 * Режими запуску додатка.
 *
 * @author Ruslan_A7 (RA7) <https://ra7.iuid.cc>
 * Код може містити деякі частини, що були створені за допомогою ChatGPT.
 * @license RA7 Open Free License
 * @github <https://github.com/Ruslan-A7>
 */
enum LaunchModeEnum: int {

    /** Розробка - все видно всім */
    case Development = 1;

    /** Закритий - сайт недоступний для всіх */
    case Closed = 2;

    /** Альфа - усім видно лише критичні помилки, попередження та нотифікації */
    case Alpha = 3;

    /** Бета - усім видно лише критичні помилки */
    case Beta = 4;

    /** Робочий режим - усім видно лише повідомлення що виникла якась помилка і адміністрацію повідомлено (без відображення деталей) */
    case Production = 5;

    /** Призупинений - доступ лише для адміністрації з повідомленням про технічні роботи для всіх інших */
    case Paused = 6;

}